data/ninjafoam/14/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    //model           kEpsilon;
    model           RNGkEpsilon;

    turbulence      on;

    printCoeffs     on;

    kEpsilonCoeffs
    {
        Cmu          0.09;
        C1           1.44;
        C2           1.92;
        C3           0;
        sigmak       1;
        sigmaEps     1.3;
    }

    RNGkEpsilonCoeffs
    {
         Cmu         0.085;
         C1          0.92;
         C2          1.68;
         C3          0;
         sigmak      0.7179;
         sigmaEps    0.7179;
         eta0        4.38;
         beta        0.012;
    }
}

// ************************************************************************* //
