data/ninjafoam/14/system/controlDict_simpleFoam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       latestTime;

stopAt          endTime;

endTime         1000;

deltaT          1.0;

writeControl    timeStep;

writeInterval   $nIterations$;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

libs
(
    "$lib$"
);

functions
{
    // to monitor residuals live or post-simulation,run:
    //  foamMonitor -l postProcessing/residuals/52/residuals.dat
    // see https://doc.cfd.direct/openfoam/user-guide-v11/graphs-monitoring section 7.4.4 "Live monitoring of data"
    #includeFunc  residuals
}

// ************************************************************************* //
