data/ninjafoam/14/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  GAMG
        tolerance               1e-06;
        relTol                  0.001;
        smoother                GaussSeidel;
        nPreSweeps              0;
        nPostSweeps             2;
        cacheAgglomeration      false;
        nCellsInCoarsestLevel   20;
        agglomerator            faceAreaPair;
        mergeLevels             1;
    };

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-06;
        relTol          0.0;
    };

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.001;
    };

    epsilon
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.001;
    };

    cellDisplacement
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 6;
    pRefCell                 0;
    pRefValue                0.0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell                 0;
    pRefValue                0.0;

    residualControl
    {
        p           0.00001;
        U           0.00001;
        k           0.00001;
        epsilon     0.00001;
    }
}

relaxationFactors
{
    fields
    {
        p           0.5;
    }
    equations
    {
        U           0.5;
        k           0.6;
        epsilon     0.6;
    }
}

// ************************************************************************* //
