data/ninjafoam/14/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

setFormat  raw;
interpolationScheme cellPoint;

fields  (U k);

sets
(
    points
    {
        type    points;
        axis    xyz;
        ordered no;
        points
        (
            $points$
        );
    }
);

// ************************************************************************* //
