data/ninjafoam/14/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   raw;  //vtk;//raw;
interpolationScheme $interpolationScheme$;  //cellPoint;//cell;

fields
(
    U
    k
);

surfaces
(
    triSurfaceSampling
    {
        type        triSurfaceMesh;
        surface     $stlFileName$;
        source      cells;
        interpolate yes;
    }
);

// ************************************************************************* //
