data/ninjafoam/14/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name   refineCells;
        type   cellSet;
        action new;
        source surfaceToCell;
        file            "$terrain$.stl";
        useSurfaceOrientation false;     // use closed surface inside/outside test (ignores includeCut, outsidePoints)
        outsidePoints   (($xout$ $yout$ $zout$));    // definition of outside
        includeCut      false;    // cells cut by surface
        includeInside   false;    // cells not on outside of surf
        includeOutside  false;    // cells on outside of surf
        nearDistance    $nearDistance$;     // cells with centre near surf (set to -1 if not used)
        curvature       -100;     // cells within nearDistance and near surf curvature (set to -100 if not used)
    }
);

// ************************************************************************* //
